In [59]:
import numpy as np
import pandas as pd

In [60]:
my = {'A':[2,8,6],'B':[12,np.nan,6],'C':[5,np.nan,np.nan]}

In [61]:
df = pd.DataFrame(my)

In [62]:
df

   A     B    C
0  2  12.0  5.0
1  8   NaN  NaN
2  6   6.0  NaN

In [63]:
df.dropna()

   A     B    C
0  2  12.0  5.0

In [64]:
df.dropna(axis=1)

   A
0  2
1  8
2  6

In [65]:
df.dropna(thresh=2)

   A     B    C
0  2  12.0  5.0
2  6   6.0  NaN

In [66]:
df.dropna(axis=1,thresh=2)

   A     B
0  2  12.0
1  8   NaN
2  6   6.0

In [67]:
df.fillna(value='ramesh')

   A       B       C
0  2      12       5
1  8  ramesh  ramesh
2  6       6  ramesh

In [68]:
df['B'].fillna(value=df['B'].mean())

0    12.0
1     9.0
2     6.0
Name: B, dtype: float64

In [69]:
df['C'].fillna(value=df['C'].mean())

0    5.0
1    5.0
2    5.0
Name: C, dtype: float64